#XGBoost Example

In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer as Imputer

from xgboost import XGBRegressor

In [2]:
Mall_Customers = pd.read_csv('Mall_Customers.csv')
Mall_Customers.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [3]:
Mall_Customers.drop('CustomerID',axis =1, inplace=True)
Mall_Customers.head()

   Gender  Age  Annual Income (k$)  Spending Score (1-100)
0    Male   19                  15                      39
1    Male   21                  15                      81
2  Female   20                  16                       6
3  Female   23                  16                      77
4  Female   31                  17                      40

In [4]:
Gender = pd.get_dummies(Mall_Customers["Gender"], drop_first=True)
Gender.head()

   Male
0     1
1     1
2     0
3     0
4     0

In [5]:
Mall_Customers.drop('Gender',axis =1, inplace=True)
Mall_Customers.head()

   Age  Annual Income (k$)  Spending Score (1-100)
0   19                  15                      39
1   21                  15                      81
2   20                  16                       6
3   23                  16                      77
4   31                  17                      40

In [6]:
data = pd.concat([Mall_Customers,Gender], axis=1)
data.head()

   Age  Annual Income (k$)  Spending Score (1-100)  Male
0   19                  15                      39     1
1   21                  15                      81     1
2   20                  16                       6     0
3   23                  16                      77     0
4   31                  17                      40     0

In [7]:
y = data.Male
X = data.drop(['Male'], axis=1).select_dtypes(exclude=['object'])
train_X, test_X, train_y, test_y = train_test_split(X.to_numpy(), y.to_numpy(), test_size=0.25)

In [8]:
my_imputer = Imputer()
train_X = my_imputer.fit_transform(train_X)
test_X = my_imputer.transform(test_X)

In [9]:
my_model = XGBRegressor()

In [10]:
my_model.fit(train_X, train_y)

[13:41:16] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor()

In [11]:
my_model.fit(train_X,train_y)

[13:41:17] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor()

In [12]:
my_model.score(train_X,train_y)

0.7436628182307183

In [15]:
predictions = my_model.predict(test_X)

from sklearn.metrics import mean_absolute_error
print("Mean Absolute Error : " + str(mean_absolute_error(predictions, test_y)))

Mean Absolute Error : 0.46564853